function makeLetter () {
	var a,aa_word = 17;
var main_letter = Math.floor((Math.random()*53)+0); //rand(0,53);
var letter_attr = Math.floor((Math.random()*21)+0); //rand(0,21);
if(main_letter<17){
	a = '&#x'+((parseInt('0x904',16)+main_letter)).toString(16).toUpperCase()+";";
}
else {
	a = '&#x'+((parseInt('0x904',16)+main_letter)).toString(16).toUpperCase()+";&#x"+((parseInt('0x93A',16)+main_letter)).toString(16).toUpperCase()+";";
}
return a;

}

function makeWord() {
	word_letter_count = Math.floor((Math.random()*7)+1);
	var letterss = '';
	for (var i=0; i <word_letter_count ; i++) {
		letterss += makeLetter();
	}

	return letterss;	
}

function makeSentence() {
	para_word_count = Math.floor(Math.random() * (10 - 3 + 1)) + 3;
	var words = '';
	for (var i=0; i <para_word_count ; i++) {
		words += ' '+makeWord();
	}
	return words+"&#x0964;";
}

function makePara(a) {
	var sentence=" ";
	for (var i = 0; i < a; i++) {
			sentence += makeSentence();
		};
	return sentence+"<br>";
}

function nepaliProverbsArray() {
	var nproverbs = ["नहुनु मामा भन्दा कानै मामा जाती ।", 
				"जो हात सो साथ !", 
				"मुर्खको धन रहदैन !",
				"मेहनतको फल मिठो हुन्छ !",
				"एक हातले तालि बज्दैन!",
        		"न्यौरी मारी पछुतो!",
        		"ऋण लाग्दा नडराउनु , दिन लाग्दा डराउनु !",
        		"ताक परे तिवारी नत्र गोतामे !",
        		"घरको बाघ बनको स्याल!",
        		"मरे पछि डुमै राजा!",
        		"लिखितमको अघाडी बखतम चल्दैन!",
        		"गर्जने बादल वर्षदैन!",
        		"आफ्नो भाग्य आफैले बनाउनु पर्छ!",
       			"डोकोमा दुध दुयेर रहदैन!",
     			"भुक्ने कुकुरले टोकदैन!",
                "काग कराउदै गर्छ, पिना सुक्दै गर्छ!",
                "हाती चले बजार तो कुता भुके हजार!",
                "जिउदाको जन्ती मर्दाको मलामी!",
                "रात भरि करायो दक्षिणा हरायो!",
                "कुक्कुरलाई हड्डी पैचो!",
                "आइमाई को रुपै सत्रु, रुपै मित्रु!",
                "ऋण लिदा पनि नलिनु, दिदा पनि नदिनु!",
                "उधारो प्रेम को कैची हो!",
                "मारे पाप पाले पुन्ये!",
                "राडी लाई लैजौला नभन्नु, गरिब लाई दिउला नभन्नु!",
                "फोश्रो आशा न देखाऊ नु!",
                "पहिले गरेर देखाउनु अनि भन्नु!",
        		"लुट को धन फुफु को श्राध!",
                "अजिंगर को आहारा दैब ले पुराऊ छ!",
                "मरी लानु केहि छैन!",
                "धन भने पछि महादेव को पनि तीन नेत्र!",
                "बिनाश काले बिपरिते बुद्दी!",
                "हाती को दुइटा दात हुन्छ, एउटा खाने अर्को देखाउने!",
                "फलामले फलामलाई काटछ!",
                "रात गए अग्रात पलाउँछ!",
               	"बेलामा छोरा छोरिलाई नकुटेपछि आफ्नो छाती पिट्नु पर्छ!",
       	        "दैबले दिन्छ पितृले हर्छ !",
                "मर्नै परेपछि खुट्टै तानेर मर्ने!",
        		"जसले मह काढ्छ उसले हात चाट्छ !",
                "आफ्नो थैलोको गाँठो कस्नु , अरुलाई दोष नदिनु!",
                "जसको शक्ति उस्को भक्ति!",
                "जसको लाठी उसको भैस!",
                "लोग्ने स्वास्नीको झगडा परालको आगो!",
                "अक्चु खाए बक्छु खाए झुसे बारुलो!",
        		"आए आँप गए झटारो!",
                "सुनलाई खोल लाउनु पर्दैन!",
                "दुश्मन खोज्न टाढा जानु पर्दैन!",
                "बाँदरको हातमा नरिवल!",
                "भन्नै परे पछी भित्तै पुर्यएर भन्नु!",
                "सुनार को सय चोत्, लोहर को एक चोत!",
                "धनै रह्यो, मनै रह्यो !",
                "एक्ता नै बल हो!",
        	    "सय को लाठि, एक को बोज!",
                "सुन लाई खोल लगाउँन पर्दैन!",
                "गु लाई चलाए गन्ध!",
                "पशुपती को जात्रा सिद्रा को ब्यापार!",
                "आज को काम लाई भोली कहिले न भन्नु!",
                "काम साछे आफु लाई, खाना साछे अरुलाई!",
                "खराब कुरा सुन्ने भित्ता को पनी कान हुन्छ!",
                "हुने गम्किन छ, न हुने चम्किन छ!",
                "सत्त्य को धन रहन्छ, असत्त्य को धन रहदैन!",
                "घमन्ड को घढा फुटछ!",
                "टुहुरो को दिन फर्कन्छ!",
                "मौका मा हिरा पनी फोर्न सक्नु पर्छ!",
                "गु पुछेको टालो पनी बेला मा काम लाग्छ!",
                "माग्ने लाई छान्ने अधिकार हुँदैन!",
                "बिद्या नै धन हो!",
                "भोजन हैन भोक मिठो!",
                "भोको पेट ले सोचन सक्दैन!",
                "रात कि रानि!",
                "साउन को भेल लाई बेल्ला मा रोक्न सके बाली राम्रो हुन्छ!",
                "घोडा चाडने मान्छे लडछ!",
        		"बत्ती निभ्नु आघी धपक्क बल्छ!",
                "सक्दो गर्नु राम्रो हो!",
                "राम राज्य भै राखेकोछ!",
                "जो डर्यो, सो मर्यो!",
                "नभरेको गाग्रो छछल किन्छ!",
                "हाथ को माछा छोरेर पोखरी को माछा खोज्ने !",
                "कुन्ता कि बुहरी भ्टमास खा कि !",
                "भाइ गोठ सालो धुरि!",
                "कसैलाई लाखा कसैलाई पाखा !",
                "छन गेरी सबै मेरी छैन गेरी सबै तेरि !",
                "बाघ ले सिनो खादैन !",
                "मुख मा राम राम बगली मा छुरा !",
                "आफै त महादेव उतनो पर कस्ले देला बर!",
                "लात को घोडा बात ले मान्दैन !",
                "हिस्स बुढी को खिस्स दात !",
                "सबै कुकुर कासी गए, गु कस्ले खाने!",
                "खिर ख्वाएर हिलो ले चुठाउँने!",
                "फोकट को पाए एक मानो चुक पनी खान्छ !",
                "बाघ बुढो स्याल तन्नेरी एक हुँदैन!",
                "मेरो गोरु को बाररै टक्का!",
                "की त हसतीनआपुर को राज्, कि त चपरी मुनी को बास्!",
                "जोगी को घर मा सन्यासी पाउना !",
                "चिन्नु न जान्नु घोडा चढि माग्नु !",
                "लहरा तान्दा पहरा गर्जिन्छ !",
                "सस्तो बेसार ले पखला लाग्छ !",
                "परि-श्रम को फाल मिठो हुन्छ !",
                "थोपा थोपा मिलेर सागर बन्दछ !",
                "भाइ फुटे गवार लुटे !",
                "औंला दिदा डुडो निल्ने !",
                "लाटो को देश मा गाडो तन्नेरी !",
                "काग भन्दा कोइली चन्ख !",
                "लाटो खान्छ एक बल्ड्याङ्, बाठो खान्छ तीन बल्ड्याङ !",
                "काम गर्ने हनुमान पगदी कस्ने ढेडु !",
                "मामा को घोडा मा भान्जा को हे हे !",
                "चोक्टा खान गएको बुडी झोल्मा डुबेर मोरि !",
                "अर्का को आङ को जुम्रा देख्नेले आफ्नो आङ को भैसी देख्दैन !",
                "अर्थी र औश्धी मिठो हुँदैन !",
                "तित्रा को मुखै बैरि !",
                "पर्छ टर्छ !",
                "खाउ भने कान्छा बाउ को अनुहार, न खाउ भने दिन भरी को सिकार !",
        		"हुल मुल मा जिउ जोगाउनु, आनिकल मा बिउ जोगाउनु!",
                "जस्ले पैसालाई चिन्दैन, तेस्लाई पैसा ले पनी चिन्दैन!",
                "जो सहे सो रहे !",
                "एक पटक को चोर्, सदा को चोर !",
                "एक दिन को पाउना मिठो मिठो खा, दुइ दिन को पाउना जस्तो सुकैखा, तीन दिन को पाउना जत्ता सुक्कै जा ।",
                "घाटी मा अड्केको हाड निल्नु न वोकल्नु ।",
                "वोरालो लागेको बाघ लाई बाछो ले लखेट्छ ।",
                "हाथी आयो हाथी आयो फुस्सा ।",
                "मौका मा चौका हान्न जान्नु पर्छ ।",
                "बोल्ने को पिठो बिक्छ, न बोल्ने को चामल पनि बिक्दैन ।",
                "थुतुनो र मुतुनो जोगाउनु ।"
        ];
        var max = nproverbs.length;
        randomGen = Math.floor((Math.random()*max)+0);
        console.log(nproverbs[randomGen]);
        return nproverbs[randomGen];
}

function proverbSentence(nu) {
	var sentences="";
	for (var i = 0; i < nu; i++) {
		sentences += nepaliProverbsArray()+" ";
	};

	return sentences;
}

function helloWorld() {
	var a ="helloWorld";
	console.log(a);
}